package org.msa.booksearch.core.resources

/**
 * این اینترفیس برای مدیریت خطاهای مرتبط با عملیات داده طراحی شده است.
 * خطاها به دو دسته کلی تقسیم می‌شوند:
 * - خطاهای راه دور (Remote): خطاهای مرتبط با شبکه و سرور.
 * - خطاهای محلی (Local): خطاهای مرتبط با سیستم محلی و ذخیره‌سازی.
 */
sealed interface DataError : Error {

    /**
     * خطاهای راه دور (Remote Errors)
     * این خطاها زمانی رخ می‌دهند که در ارتباط با سرور یا شبکه مشکلی پیش بیاید.
     */
    enum class Remote : DataError {
        /**
         * زمانی که درخواست HTTP به دلیل تأخیر بیش از حد انجام نمی‌شود.
         */
        REQUEST_TIMEOUT,

        /**
         * زمانی که تعداد درخواست‌های زیادی به سرور ارسال شده باشد.
         */
        TOO_MANY_REQUESTS,

        /**
         * زمانی که اتصال به اینترنت برقرار نیست.
         */
        NO_INTERNET,

        /**
         * زمانی که خطای داخلی در سمت سرور رخ می‌دهد.
         */
        SERVER,

        /**
         * زمانی که خطایی در سریال‌سازی یا پارس داده‌ها رخ می‌دهد.
         */
        SERIALIZATION,

        /**
         * خطای ناشناخته که دلیل آن مشخص نیست.
         */
        UNKNOWN
    }

    /**
     * خطاهای محلی (Local Errors)
     * این خطاها مربوط به عملیات سیستم محلی یا محدودیت‌های ذخیره‌سازی هستند.
     */
    enum class Local : DataError {
        /**
         * زمانی که فضای دیسک برای ذخیره‌سازی داده کافی نیست.
         */
        DISK_FULL,

        /**
         * خطای ناشناخته که دلیل آن مشخص نیست.
         */
        UNKNOWN
    }
}
