package org.msa.booksearch.data.datasource.local.modelEntity

import androidx.room.Entity
import androidx.room.PrimaryKey

/**
 * مدل داده‌ای BookEntity که برای ذخیره‌سازی اطلاعات کتاب در پایگاه داده استفاده می‌شود.
 * این مدل نماینده‌ی یک کتاب است که می‌تواند شامل اطلاعات مختلفی مانند عنوان کتاب،
 * شرح کتاب، تصویر، زبان‌ها، نویسندگان و سایر ویژگی‌های مربوط به کتاب باشد.
 *
 * @property id شناسه یکتا برای هر کتاب که به عنوان PrimaryKey عمل می‌کند.
 * @property title عنوان کتاب.
 * @property description توضیحاتی که برای کتاب وجود دارد (ممکن است خالی باشد).
 * @property imageUrl URL تصویر کتاب.
 * @property languages لیستی از زبان‌های موجود برای کتاب.
 * @property authors لیستی از نام‌های نویسندگان کتاب.
 * @property firstPublishYear سال اولین انتشار کتاب.
 * @property ratingsAverage میانگین امتیاز کتاب (در صورت وجود).
 * @property ratingsCount تعداد امتیازاتی که برای کتاب داده شده است.
 * @property numPagesMedian تعداد صفحات کتاب (ممکن است برای بعضی کتاب‌ها موجود نباشد).
 * @property numEditions تعداد نسخه‌های منتشر شده از کتاب.
 */
@Entity
data class BookEntity(
    /**
     * شناسه یکتا برای کتاب که به عنوان PrimaryKey در پایگاه داده استفاده می‌شود.
     * این فیلد به‌طور معمول از API یا دیتابیس خارجی دریافت می‌شود.
     */
    @PrimaryKey(autoGenerate = false) val id: String,

    /**
     * عنوان کتاب. این فیلد اطلاعات مربوط به عنوان کتاب را ذخیره می‌کند.
     */
    val title: String,

    /**
     * شرح کتاب. این فیلد به‌صورت اختیاری (nullable) است و ممکن است برخی کتاب‌ها شرح نداشته باشند.
     * در صورت وجود، یک رشته از متن است.
     */
    val description: String?,

    /**
     * URL تصویر کتاب. این URL می‌تواند به تصویری از کتاب اشاره کند که در صورت نیاز برای نمایش استفاده می‌شود.
     */
    val imageUrl: String,

    /**
     * لیستی از زبان‌های موجود برای کتاب. این فیلد یک لیست از رشته‌ها را ذخیره می‌کند که نمایانگر زبان‌های مختلفی است
     * که کتاب به آن‌ها ترجمه شده است.
     */
    val languages: List<String>,

    /**
     * لیستی از نویسندگان کتاب. این فیلد شامل نام‌های نویسندگان کتاب است.
     * این فیلد می‌تواند شامل چندین نویسنده باشد.
     */
    val authors: List<String>,

    /**
     * سال اولین انتشار کتاب. این فیلد یک رشته (String) است که سال اولین انتشار کتاب را ذخیره می‌کند.
     * ممکن است برخی کتاب‌ها تاریخ انتشار نداشته باشند.
     */
    val firstPublishYear: String?,

    /**
     * میانگین امتیاز کتاب از نظر کاربران. این فیلد یک مقدار عددی است که میانگین امتیازهایی
     * که توسط کاربران به کتاب داده شده‌اند را نمایش می‌دهد.
     */
    val ratingsAverage: Double?,

    /**
     * تعداد کل امتیازهایی که برای کتاب داده شده است.
     * این فیلد یک عدد صحیح است که نشان‌دهنده تعداد افرادی است که برای کتاب امتیاز داده‌اند.
     */
    val ratingsCount: Int?,

    /**
     * تعداد صفحات کتاب. این فیلد یک مقدار عددی است که نشان‌دهنده تعداد صفحات موجود در نسخه کتاب است.
     * ممکن است در برخی کتاب‌ها این اطلاعات در دسترس نباشد.
     */
    val numPagesMedian: Int?,

    /**
     * تعداد نسخه‌های منتشر شده از کتاب. این فیلد تعداد نسخه‌های مختلف کتاب را نشان می‌دهد.
     */
    val numEditions: Int
)
